In [2]:
df = spark.read.csv("data/train.csv")

In [3]:
df.show(5)

+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
|        _c0|     _c1|   _c2|                 _c3|   _c4|_c5|  _c6|  _c7|             _c8|    _c9| _c10|    _c11|
+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
|          1|       0|     3|Braund, Mr. Owen ...|  male| 22|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female| 38|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female| 26|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female| 35|    1|    0|          113803|   53.1| C123|       S|
+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

In [4]:
display(df)

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string, _c5: string, _c6: string, _c7: string, _c8: string, _c9: string, _c10: string, _c11: string]

In [5]:
df.toPandas().head(10)

,_c0,_c1,_c2,_c3,_c4,_c5,_c6,_c7,_c8,_c9,_c10,_c11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,None,S
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,None,S
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
5,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,None,S
6,6,0,3,"Moran, Mr. James",male,None,0,0,330877,8.4583,None,Q
7,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
8,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.075,None,S
9,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,None,S

In [9]:
df = spark.read.option("delimiter", ",").option("header", "true").option("inferSchema", "true").csv("data/train.csv")

In [7]:
df.show(5)

+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male| 22|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female| 38|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female| 26|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female| 35|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male| 35|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+---+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

In [10]:
df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [13]:
from pyspark.sql.types import StructType, StructField, FloatType, BooleanType
from pyspark.sql.types import DoubleType, IntegerType, StringType
schema = StructType([
StructField("PassengerId", IntegerType(),True),
StructField("Survived", IntegerType(),True),
StructField("Pclass", IntegerType(),True),
StructField("Name", StringType(),True),
StructField("Sex", StringType(),True),
StructField("Age", IntegerType(),True),
StructField("SibSp", IntegerType(),True),
StructField("Parch", IntegerType(),True),
StructField("Ticket", StringType(),True),
StructField("Fare", DoubleType(),True),
StructField("Cabin", StringType(),True),
StructField("Embarked", StringType(),True)
])

In [16]:
df = spark.read.option("delimiter", ",").option("header", "true").schema(schema).csv("data/train.csv")

In [17]:
df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [19]:
df.filter(df.Age > 60).show(10)

+-----------+--------+------+--------------------+------+---+-----+-----+----------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|Age|SibSp|Parch|    Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+---+-----+-----+----------+-------+-----------+--------+
|         34|       0|     2|Wheadon, Mr. Edwa...|  male| 66|    0|    0|C.A. 24579|   10.5|       null|       S|
|         55|       0|     1|Ostby, Mr. Engelh...|  male| 65|    0|    1|    113509|61.9792|        B30|       C|
|         97|       0|     1|Goldschmidt, Mr. ...|  male| 71|    0|    0|  PC 17754|34.6542|         A5|       C|
|        171|       0|     1|Van der hoef, Mr....|  male| 61|    0|    0|    111240|   33.5|        B19|       S|
|        253|       0|     1|Stead, Mr. Willia...|  male| 62|    0|    0|    113514|  26.55|        C87|       S|
|        276|       1|     1|Andrews, Miss. Ko...|female| 63|    1|    0|     13502|77.9583|         D7|       S|
|        281|       0|     3|    Duane, Mr. Frank|  male| 65|    0|    0|    336439|   7.75|       null|       Q|
|        327|       0|     3|Nysveen, Mr. Joha...|  male| 61|    0|    0|    345364| 6.2375|       null|       S|
|        439|       0|     1|   Fortune, Mr. Mark|  male| 64|    1|    4|     19950|  263.0|C23 C25 C27|       S|
|        457|       0|     1|Millet, Mr. Franc...|  male| 65|    0|    0|     13509|  26.55|        E38|       S|
+-----------+--------+------+--------------------+------+---+-----+-----+----------+-------+-----------+--------+
only showing top 10 rows

In [25]:
df = df[df['Age'] > 60]

In [50]:
col('Age').alias('Age2')

Column<'Age AS Age2'>

In [54]:
col('Age').isNull().isNotNull()

Column<'((Age IS NULL) IS NOT NULL)'>

In [44]:
from pyspark.sql.functions import col

In [52]:
df = df[col('Age').isNull()]

In [53]:
df.show(10)

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

In [39]:
a = [x.Age for x in df.select('Age').collect()]

In [40]:
a

[66,
 65,
 71,
 61,
 62,
 63,
 65,
 61,
 64,
 65,
 63,
 71,
 64,
 62,
 62,
 61,
 80,
 70,
 70,
 62,
 74]

In [43]:
df.select(['Age', 'Pclass'])

AttributeError: 'str' object has no attribute 'alias'

In [ ]:
quary = "select * from tytanic_table where date='2020-01-01'" # Delta -> Delta Engyne
df = spark.sql(query)
# dzialania itp
#df.saveTable()